dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCan_regdef.h
/** \brief Event 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_TXEVENT_E0_Bits B;        /**< \brief Bitfield access */
} Ifx_CAN_TXEVENT_E0;

/** \brief Event 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_TXEVENT_E1_Bits B;        /**< \brief Bitfield access */
} Ifx_CAN_TXEVENT_E1;

/** \brief Data Byte m   */
typedef union
{
    Ifx_UReg_8Bit U;                  /**< \brief Unsigned access */
    Ifx_SReg_8Bit I;                  /**< \brief Signed access */
    Ifx_CAN_TXMSG_DB_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_TXMSG_DB;

/** \brief Transmit Buffer 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_TXMSG_T0_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_TXMSG_T0;

/** \brief Transmit Buffer 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CAN_TXMSG_T1_Bits B;          /**< \brief Bitfield access */
} Ifx_CAN_TXMSG_T1;

/** \}  */

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Can_N_NT_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */
/** \brief NT object */
typedef volatile struct _Ifx_CAN_N_NT
{
       Ifx_CAN_N_NT_CCR                    CCR;                    /**< \brief 0, Node ${i} Timer Clock Control Register*/
       Ifx_CAN_N_NT_ATTR                   ATTR;                   /**< \brief 4, Node ${i} Timer A Transmit Trigger Register*/
       Ifx_CAN_N_NT_BTTR                   BTTR;                   /**< \brief 8, Node ${i} Timer B Transmit Trigger Register*/
       Ifx_CAN_N_NT_CTTR                   CTTR;                   /**< \brief C, Node ${i} Timer C Transmit Trigger Register*/
       Ifx_CAN_N_NT_RTR                    RTR;                    /**< \brief 10, Node ${i} Timer Receive Timeout Register*/
} Ifx_CAN_N_NT;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Can_N_RX_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */
/** \brief RX object */
typedef volatile struct _Ifx_CAN_N_RX
{
       Ifx_CAN_N_RX_F0C                    F0C;                    /**< \brief 0, Rx FIFO 0 Configuration ${i}*/
       Ifx_CAN_N_RX_F0S                    F0S;                    /**< \brief 4, Rx FIFO 0 Status ${i}*/
       Ifx_CAN_N_RX_F0A                    F0A;                    /**< \brief 8, Rx FIFO 0 Acknowledge ${i}*/
       Ifx_CAN_N_RX_BC                     BC;                     /**< \brief C, Rx Buffer Configuration ${i}*/
       Ifx_CAN_N_RX_F1C                    F1C;                    /**< \brief 10, Rx FIFO 1 Configuration ${i}*/
       Ifx_CAN_N_RX_F1S                    F1S;                    /**< \brief 14, Rx FIFO 1 Status ${i}*/
       Ifx_CAN_N_RX_F1A                    F1A;                    /**< \brief 18, Rx FIFO 1 Acknowledge ${i}*/
       Ifx_CAN_N_RX_ESC                    ESC;                    /**< \brief 1C, Rx Buffer/FIFO Element Size Configuration ${i}*/
} Ifx_CAN_N_RX;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Can_N_TX_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */
/** \brief TX object */
typedef volatile struct _Ifx_CAN_N_TX
{
       Ifx_CAN_N_TX_BC                     BC;                     /**< \brief 0, Tx Buffer Configuration ${i}*/
       Ifx_CAN_N_TX_FQS                    FQS;                    /**< \brief 4, Tx FIFO/Queue Status ${i}*/
       Ifx_CAN_N_TX_ESC                    ESC;                    /**< \brief 8, Tx Buffer Element Size Configuration ${i}*/
       Ifx_CAN_N_TX_BRP                    BRP;                    /**< \brief C, Tx Buffer Request Pending ${i}*/
       Ifx_CAN_N_TX_BAR                    BAR;                    /**< \brief 10, Tx Buffer Add Request ${i}*/
       Ifx_CAN_N_TX_BCR                    BCR;                    /**< \brief 14, Tx Buffer Cancellation Request ${i}*/
       Ifx_CAN_N_TX_BTO                    BTO;                    /**< \brief 18, Tx Buffer Transmission Occurred ${i}*/
       Ifx_CAN_N_TX_BCF                    BCF;                    /**< \brief 1C, Tx Buffer Cancellation Finished ${i}*/
       Ifx_CAN_N_TX_BTIE                   BTIE;                   /**< \brief 20, Tx Buffer Transmission Interrupt Enable ${i}*/
       Ifx_CAN_N_TX_BCIE                   BCIE;                   /**< \brief 24, Tx Buffer Cancellation Finished Interrupt Enable ${i}*/
       Ifx_UReg_8Bit                       reserved_28[8];         /**< \brief 28, \internal Reserved */
       Ifx_CAN_N_TX_EFC                    EFC;                    /**< \brief 30, Tx Event FIFO Configuration ${i}*/
       Ifx_CAN_N_TX_EFS                    EFS;                    /**< \brief 34, Tx Event FIFO Status ${i}*/
       Ifx_CAN_N_TX_EFA                    EFA;                    /**< \brief 38, Tx Event FIFO Acknowledge ${i}*/
} Ifx_CAN_N_TX;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Can_N_TT_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */
/** \brief TT object */
typedef volatile struct _Ifx_CAN_N_TT
{
       Ifx_CAN_N_TT_TMC                    TMC;                    /**< \brief 0, TT Trigger Memory Configuration ${i}*/
       Ifx_CAN_N_TT_RMC                    RMC;                    /**< \brief 4, TT Reference Message Configuration ${i}*/
       Ifx_CAN_N_TT_OCF                    OCF;                    /**< \brief 8, TT Operation Configuration ${i}*/
       Ifx_CAN_N_TT_MLM                    MLM;                    /**< \brief C, TT Matrix Limits ${i}*/
       Ifx_CAN_N_TT_TURCF                  TURCF;                  /**< \brief 10, TUR Configuration ${i}*/
       Ifx_CAN_N_TT_OCN                    OCN;                    /**< \brief 14, TT Operation Control ${i}*/
       Ifx_CAN_N_TT_GTP                    GTP;                    /**< \brief 18, TT Global Time Preset ${i}*/
       Ifx_CAN_N_TT_TMK                    TMK;                    /**< \brief 1C, TT Time Mark ${i}*/
       Ifx_CAN_N_TT_IR                     IR;                     /**< \brief 20, TT Interrupt Register ${i}*/
       Ifx_CAN_N_TT_IE                     IE;                     /**< \brief 24, TT Interrupt Enable ${i}*/
       Ifx_UReg_8Bit                       reserved_28[4];         /**< \brief 28, \internal Reserved */
       Ifx_CAN_N_TT_OST                    OST;                    /**< \brief 2C, TT Operation Status ${i}*/
       Ifx_CAN_N_TT_TURNA                  TURNA;                  /**< \brief 30, TUR Numerator Actual ${i}*/
       Ifx_CAN_N_TT_LGT                    LGT;                    /**< \brief 34, TT Local & Global Time ${i}*/
       Ifx_CAN_N_TT_CTC                    CTC;                    /**< \brief 38, TT Cycle Time & Count ${i}*/
       Ifx_CAN_N_TT_CPT                    CPT;                    /**< \brief 3C, TT Capture Time ${i}*/
       Ifx_CAN_N_TT_CSM                    CSM;                    /**< \brief 40, TT Cycle Sync Mark ${i}*/
} Ifx_CAN_N_TT;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Can_N_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief N object */
typedef volatile struct _Ifx_CAN_N
{
       Ifx_CAN_N_ACCENNODE0                ACCENNODE0;             /**< \brief 0, Access Enable Register CAN Node ${i} 0*/
       Ifx_UReg_8Bit                       reserved_4[4];          /**< \brief 4, \internal Reserved */
       Ifx_CAN_N_STARTADR                  STARTADR;               /**< \brief 8, Start Address Node ${i}*/
       Ifx_CAN_N_ENDADR                    ENDADR;                 /**< \brief C, End Address Node ${i}*/
       Ifx_CAN_N_ISREG                     ISREG;                  /**< \brief 10, Interrupt Signalling Register ${i}*/
       Ifx_CAN_N_GRINT1                    GRINT1;                 /**< \brief 14, Interrupt routing for Groups 1 ${i}*/
       Ifx_CAN_N_GRINT2                    GRINT2;                 /**< \brief 18, Interrupt routing for Groups 2 ${i}*/
       Ifx_UReg_8Bit                       reserved_1C[4];         /**< \brief 1C, \internal Reserved */
       Ifx_CAN_N_NT                        NT;                     /**< \brief 20, Node ${i} Timer Receive Timeout Register*/
       Ifx_UReg_8Bit                       reserved_34[12];        /**< \brief 34, \internal Reserved */
       Ifx_CAN_N_NPCR                      NPCR;                   /**< \brief 40, Node ${i} Port Control Register*/
       Ifx_UReg_8Bit                       reserved_44[172];       /**< \brief 44, \internal Reserved */
       Ifx_CAN_N_TTCR                      TTCR;                   /**< \brief F0, Time Trigger Control Register*/
       Ifx_UReg_8Bit                       reserved_F4[12];        /**< \brief F4, \internal Reserved */
       Ifx_CAN_N_CREL                      CREL;                   /**< \brief 100, Core Release Register ${i}*/
       Ifx_CAN_N_ENDN                      ENDN;                   /**< \brief 104, Endian Register ${i}*/
       Ifx_UReg_8Bit                       reserved_108[4];        /**< \brief 108, \internal Reserved */
       Ifx_CAN_N_DBTP                      DBTP;                   /**< \brief 10C, Data Bit Timing & Prescaler Register ${i}*/
       Ifx_CAN_N_TEST                      TEST;                   /**< \brief 110, Test Register ${i}*/
       Ifx_CAN_N_RWD                       RWD;                    /**< \brief 114, RAM Watchdog ${i}*/
       Ifx_CAN_N_CCCR                      CCCR;                   /**< \brief 118, CC Control Register ${i}*/
       Ifx_CAN_N_NBTP                      NBTP;                   /**< \brief 11C, Nominal Bit Timing & Prescaler Register ${i}*/
       Ifx_CAN_N_TSCC                      TSCC;                   /**< \brief 120, Timestamp Counter Configuration ${i}*/
       Ifx_CAN_N_TSCV                      TSCV;                   /**< \brief 124, Timestamp Counter Value ${i}*/
       Ifx_CAN_N_TOCC                      TOCC;                   /**< \brief 128, Timeout Counter Configuration ${i}*/
       Ifx_CAN_N_TOCV                      TOCV;                   /**< \brief 12C, Timeout Counter Value ${i}*/
       Ifx_UReg_8Bit                       reserved_130[16];       /**< \brief 130, \internal Reserved */
       Ifx_CAN_N_ECR                       ECR;                    /**< \brief 140, Error Counter Register ${i}*/
       Ifx_CAN_N_PSR                       PSR;                    /**< \brief 144, Protocol Status Register ${i}*/
       Ifx_CAN_N_TDCR                      TDCR;                   /**< \brief 148, Transmitter Delay Compensation Register ${i}*/
       Ifx_UReg_8Bit                       reserved_14C[4];        /**< \brief 14C, \internal Reserved */
       Ifx_CAN_N_IR                        IR;                     /**< \brief 150, Interrupt Register ${i}*/
       Ifx_CAN_N_IE                        IE;                     /**< \brief 154, Interrupt Enable ${i}*/
       Ifx_UReg_8Bit                       reserved_158[40];       /**< \brief 158, \internal Reserved */
       Ifx_CAN_N_GFC                       GFC;                    /**< \brief 180, Global Filter Configuration ${i}*/
       Ifx_CAN_N_SIDFC                     SIDFC;                  /**< \brief 184, Standard ID Filter Configuration ${i}*/
       Ifx_CAN_N_XIDFC                     XIDFC;                  /**< \brief 188, Extended ID Filter Configuration ${i}*/
       Ifx_UReg_8Bit                       reserved_18C[4];        /**< \brief 18C, \internal Reserved */
       Ifx_CAN_N_XIDAM                     XIDAM;                  /**< \brief 190, Extended ID AND Mask ${i}*/
       Ifx_CAN_N_HPMS                      HPMS;                   /**< \brief 194, High Priority Message Status ${i}*/
       Ifx_CAN_N_NDAT1                     NDAT1;                  /**< \brief 198, New Data 1 ${i}*/
       Ifx_CAN_N_NDAT2                     NDAT2;                  /**< \brief 19C, New Data 2 ${i}*/
       Ifx_CAN_N_RX                        RX;                     /**< \brief 1A0, Rx Buffer/FIFO Element Size Configuration ${i}*/
       Ifx_CAN_N_TX                        TX;                     /**< \brief 1C0, */
       Ifx_UReg_8Bit                       reserved_1FC[4];        /**< \brief 1FC, \internal Reserved */
       Ifx_CAN_N_TT                        TT;                     /**< \brief 200, TT Cycle Sync Mark ${i}*/
       Ifx_UReg_8Bit                       reserved_244[444];      /**< \brief 244, \internal Reserved */
} Ifx_CAN_N;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Can_StdMsg_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief STDMSG object */
typedef volatile struct _Ifx_CAN_STDMSG
{
       Ifx_CAN_STDMSG_S0                   S0;                     /**< \brief 0, Standard Message 0*/
} Ifx_CAN_STDMSG;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Can_ExtMsg_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief EXTMSG object */
typedef volatile struct _Ifx_CAN_EXTMSG
{
       Ifx_CAN_EXTMSG_F0                   F0;                     /**< \brief 0, Filter Element 0*/
       Ifx_CAN_EXTMSG_F1                   F1;                     /**< \brief 4, Filter Element 1*/
} Ifx_CAN_EXTMSG;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Can_RxMsg_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief RXMSG object */
typedef volatile struct _Ifx_CAN_RXMSG
{
       Ifx_CAN_R0                          R0;                     /**< \brief 0, Register 0*/
       Ifx_CAN_R1                          R1;                     /**< \brief 4, Register 1*/
       Ifx_CAN_DB                          DB[64];                 /**< \brief 8, Data Byte m*/
} Ifx_CAN_RXMSG;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Can_TxEvent_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TXEVENT object */
typedef volatile struct _Ifx_CAN_TXEVENT
{
       Ifx_CAN_TXEVENT_E0                  E0;                     /**< \brief 0, Event 0*/
       Ifx_CAN_TXEVENT_E1                  E1;                     /**< \brief 4, Event 1*/
} Ifx_CAN_TXEVENT;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Can_TxMsg_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TXMSG object */
typedef volatile struct _Ifx_CAN_TXMSG
{
       Ifx_CAN_TXMSG_T0                    T0;                     /**< \brief 0, Transmit Buffer 0*/
       Ifx_CAN_TXMSG_T1                    T1;                     /**< \brief 4, Transmit Buffer 1*/
       Ifx_CAN_TXMSG_DB                    DB[64];                 /**< \brief 8, Data Byte m*/
} Ifx_CAN_TXMSG;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Can_TrigMsg_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TRIGMSG object */
typedef volatile struct _Ifx_CAN_TRIGMSG
{
       Ifx_CAN_TRIGMSG_TM0                 TM0;                    /**< \brief 0, Trigger Memory Element 0*/
       Ifx_CAN_TRIGMSG_TM1                 TM1;                    /**< \brief 4, */
} Ifx_CAN_TRIGMSG;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/** \addtogroup IfxSfr_Can_Registers_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief CAN object */
typedef volatile struct _Ifx_CAN
{
       Ifx_UReg_32Bit                      RAM[8192];             /**< \brief 0, Embedded SRAM for messages*/
       Ifx_CAN_CLC                         CLC;                    /**< \brief 8000, CAN Clock Control Register*/
       Ifx_UReg_8Bit                       reserved_8004[4];       /**< \brief 8004, \internal Reserved */
       Ifx_CAN_ID                          ID;                     /**< \brief 8008, Module Identification Register*/
       Ifx_UReg_8Bit                       reserved_800C[36];      /**< \brief 800C, \internal Reserved */
       Ifx_CAN_MCR                         MCR;                    /**< \brief 8030, Module Control Register*/
       Ifx_CAN_BUFADR                      BUFADR;                 /**< \brief 8034, Buffer receive address and transmit address*/
       Ifx_UReg_8Bit                       reserved_8038[8];       /**< \brief 8038, \internal Reserved */
       Ifx_CAN_MECR                        MECR;                   /**< \brief 8040, Measure Control Register*/
       Ifx_CAN_MESTAT                      MESTAT;                 /**< \brief 8044, Measure Status Register*/
       Ifx_UReg_8Bit                       reserved_8048[148];     /**< \brief 8048, \internal Reserved */
       Ifx_CAN_ACCENCTR0                   ACCENCTR0;              /**< \brief 80DC, Access Enable Register Control 0*/
       Ifx_UReg_8Bit                       reserved_80E0[8];       /**< \brief 80E0, \internal Reserved */
       Ifx_CAN_OCS                         OCS;                    /**< \brief 80E8, OCDS Control and Status*/
       Ifx_CAN_KRSTCLR                     KRSTCLR;                /**< \brief 80EC, Kernel Reset Status Clear Register*/
       Ifx_CAN_KRST1                       KRST1;                  /**< \brief 80F0, Kernel Reset Register 1*/
       Ifx_CAN_KRST0                       KRST0;                  /**< \brief 80F4, Kernel Reset Register 0*/
       Ifx_UReg_8Bit                       reserved_80F8[4];       /**< \brief 80F8, \internal Reserved */
       Ifx_CAN_ACCEN0                      ACCEN0;                 /**< \brief 80FC, Access Enable Register 0*/
       Ifx_CAN_N                           N[4];                   /**< \brief 8100, */
} Ifx_CAN;

/** \}  */
/******************************************************************************/
/** \}  */


/******************************************************************************/

/******************************************************************************/

#endif /* IFXCAN_REGDEF_H */
